[
   {
      "Title": "GOP's closed-door conspiracy theory led to Hill's public rebuke",
      "Date": "Wed, 27 Nov 2019 13:29:36 -0500",
      "Link": "https://news.yahoo.com/go-ps-closeddoor-conspiracy-theory-led-to-hills-public-rebuke-182936711.html",
      "Discription": "Fiona Hill rebuked Republicans last week in an impeachment inquiry hearing for pushing a “false narrative” about Ukrainian interference in the 2016 U.S. election, referencing remarks made during her prior closed-door testimony.  “I was very worried about the turn that some of the questions were taking,” Hill, who was President Trump’s top Russia adviser until July, told the House Intelligence Committee during the public hearing.  Republicans on the committee, taken aback by Hill’s remarkable broadside, were at pains to say that they were not denying Russia had interfered in the 2016 elections."
   },
   {
      "Title": "Then and now: Swiss glacier photos show impact of global warming",
      "Date": "Tue, 26 Nov 2019 13:58:47 -0500",
      "Link": "https://news.yahoo.com/then-and-now-new-photos-vs-old-in-comparisons-show-dramatic-swiss-glacier-retreat-185847495.html",
      "Discription": "A collection of images — showing photos of modern-day mountain landscapes next to archive shots of the same scenes decades earlier — reveals the dramatic change."
   },
   {
      "Title": "Couple convicted of grisly 1980s murders get surprise release from prison before being deported",
      "Date": "Tue, 26 Nov 2019 17:04:35 -0500",
      "Link": "https://news.yahoo.com/couple-convicted-grisly-1980s-murders-181331694.html",
      "Discription": "A couple convicted of a brutal double murder in 1985 have won their release from prison, and will now be handed over to immigration authorities for deportation.Jens Soering and Elizabeth Haysom were convicted in the brutal murders of Haysom’s parents, in an attack that rocked Virginia at a time when sensational crime wasn’t the norm for major news coverage."
   },
   {
      "Title": "Merkel urges Europe to stick together in China dealings",
      "Date": "Wed, 27 Nov 2019 05:41:17 -0500",
      "Link": "https://news.yahoo.com/merkel-urges-europe-stick-together-china-dealings-104117408.html",
      "Discription": "German Chancellor Angela Merkel on Wednesday urged EU countries to speak as one in their dealings with China, warning it would be \"disastrous\" to go it alone at a time of tensions with the Asian giant over technology and human rights.  \"One of the biggest dangers I see... is that everyone in Europe has their own China policy, and that we end up sending completely different signals,\" Merkel said in a speech to German lawmakers.  \"That would not be disastrous for China, but it would be disastrous for us in Europe,\" she added."
   },
   {
      "Title": "An Air Canada Boeing 787 flying across the Atlantic was forced to turn back after its windshield cracked",
      "Date": "Tue, 26 Nov 2019 10:27:00 -0500",
      "Link": "https://news.yahoo.com/air-canada-boeing-787-flying-152700242.html",
      "Discription": "Air Canada Flight 857 was due to fly from London to Toronto but instead landed in Ireland after the crack in the 787-8 windshield was noticed."
   },
   {
      "Title": "Buttigieg claims 2nd while Warren sinks in new 2020 poll",
      "Date": "Wed, 27 Nov 2019 07:18:53 -0500",
      "Link": "https://news.yahoo.com/buttigieg-claims-2nd-while-warren-121853815.html",
      "Discription": "Pete Buttigieg rocketed into second place in the Democratic presidential nomination race, polling showed Tuesday, with support for progressive ex-frontrunner Elizabeth Warren sliding behind."
   },
   {
      "Title": "Revealed: Buttigieg 2020 campaign took money from top Kavanaugh lawyers",
      "Date": "Wed, 27 Nov 2019 08:34:43 -0500",
      "Link": "https://news.yahoo.com/buttigieg-returns-donations-lawyers-represented-072043445.html",
      "Discription": "Campaign admits mistake in accepting thousands of dollars from Alexandra Walsh and Beth Wilkinson, who represented nomineePete Buttigieg’s campaign said it would return the money to the lawyers who represented Brett Kavanaugh. Photograph: Christopher Aluka Berry/ReutersPete Buttigieg’s 2020 campaign is returning thousands of dollars in donations from two top Washington lawyers who represented Brett Kavanaugh in his controversial confirmation hearing, saying it will not accept funds from people who helped secure the justice’s seat on the supreme court.Buttigieg’s campaign received $7,200 from Alexandra Walsh – $3,150 of which had already been returned because it exceeded limits – and attended a fundraiser in July that was co-hosted by the Washington lawyer. Buttigieg also received $2,800 from Beth Wilkinson, Walsh’s law partner, who also represented Kavanaugh.When asked by the Guardian about the donations, the campaign said it had overlooked the lawyers’ role in the Kavanaugh confirmation and had made a mistake in accepting the donations.It said: “With nearly 700,000 donors, a contribution we would otherwise refuse sometimes gets through. We believe the women who have courageously spoken out about Brett Kavanaugh’s assault and misconduct, and we thank the Guardian for bringing this contribution to our attention.”A spokesperson added: “[Kavanaugh] should have never been put on the supreme court and this campaign will not accept donations from those who played a role in making that happen. Accordingly, we will be returning this contribution and others from this firm.”Walsh and Wilkinson are frequent donors to Democratic causes. During this 2020 election cycle, Wilkinson has donated $1,000 to the California senator Kamala Harris’s campaign and $2,800 to the Colorado senator Michael Bennet’s campaign. Wilkinson also gave $2,800 to the New York senator Kirsten Gillibrand, who has since dropped out of the race and has been an outspoken critic of Kavanaugh.The Washington law firm Wilkinson Walsh Eskovitz represented the then nominee for the supreme court after Christine Blasey Ford accused him of sexually assaulting her when both were high school students in suburban Maryland. Walsh and Wilkinson led the charge defending Kavanaugh, even as more accusations of sexual misconduct were unearthed, and painted the judge as the victim of an “outrageous” campaign.In one case, Wilkinson questioned why women who accused Kavanaugh of assault had not immediately gone to the police to report alleged assaults, instead of members of Congress, and insisted that Kavanaugh treated women with dignity and respect.The judge has denied all of the allegations against him.In another case, Walsh sought to downplay comments that were made in Kavanaugh’s high school yearbook. When the New York Times reported that Kavanaugh was listed as a member of the “Renate Alumni” – a reference to a classmate from a neighbouring Catholic girls’ school that appeared to insinuate sexual conquest – Walsh was quoted in a statement as saying that Kavanaugh had been friends with Renate in high school and had “admired her very much”. She also stated that the two had once shared a “brief kiss goodnight”.When asked about the reference, Renate Dolphin told the New York Times that the insinuation in Kavanaugh’s yearbook was “hurtful and simply untrue”. She also denied Walsh’s assertion that she and Kavanaugh had ever kissed.Walsh did not respond to a request for comment about the Buttigieg campaign’s decision to reject her donations. Wilkinson did not immediately respond to a request for comment.The Harris and Bennet campaigns did not return a request for comment on the donations they received from Wilkinson. Gillibrand’s office also did not return a request for comment.The Buttigieg campaign has been a vocal critic of Kavanaugh and has said that, if elected, he would choose a supreme court justice similar to Ruth Bader Ginsberg, who shared his “progressive values”."
   },
   {
      "Title": "‘She slipped': Grandfather speaks on 1-year-old’s fatal fall from Royal Caribbean cruise ship",
      "Date": "Tue, 26 Nov 2019 09:54:59 -0500",
      "Link": "https://news.yahoo.com/she-slipped-grandfather-speaks-1-135821260.html",
      "Discription": "\"I didn't realize there wasn't any glass until the absolutely that it was too late,\" Salvatore Anello told CBS news in a story that aired Tuesday."
   },
   {
      "Title": "One False Move By Israel or Iran Will Lead to War",
      "Date": "Tue, 26 Nov 2019 10:14:00 -0500",
      "Link": "https://news.yahoo.com/one-false-move-israel-iran-151400699.html",
      "Discription": "Over the last two years, Israel has warned about Iran’s entrenchment in Syria. But Iran has continued its role in Syria, and it continues to threaten Israel and transfer precision guidance to Hezbollah for converting its rockets."
   },
   {
      "Title": "Gillum sets sights on denying Trump victory in Florida in 2020",
      "Date": "Tue, 26 Nov 2019 15:53:11 -0500",
      "Link": "https://news.yahoo.com/andrew-gillum-sets-sights-on-denying-trump-victory-in-florida-in-2020-205311950.html",
      "Discription": "Andrew Gillum says he knows why President Trump left his lifelong home of New York to take up residence in Florida and doubts his “antics” for reelection will work. "
   },
   {
      "Title": "One of Supreme Court's most important abortion cases has just begun",
      "Date": "Tue, 26 Nov 2019 03:21:39 -0500",
      "Link": "https://news.yahoo.com/one-supreme-courts-most-important-082139004.html",
      "Discription": "A 63-page opening brief was filed late Monday night by the Center for Reproductive Rights (CRR) in the case"
   },
   {
      "Title": "Texas inmate freed while innocence claims investigated",
      "Date": "Tue, 26 Nov 2019 12:11:02 -0500",
      "Link": "https://news.yahoo.com/texas-inmate-freed-while-innocence-171102644.html",
      "Discription": "A Houston man serving a life sentence for a 2010 fatal stabbing was freed on bond Tuesday while authorities reinvestigate his case, including new DNA evidence that his lawyers say exonerates him.  Lydell Grant has been in prison for seven years for the killing of 28-year-old Aaron Scheerhoorn outside of a Houston club.  Grant was convicted in 2012."
   },
   {
      "Title": "China says developed countries lack 'political will' on climate goals",
      "Date": "Wed, 27 Nov 2019 04:36:29 -0500",
      "Link": "https://news.yahoo.com/china-says-developed-countries-lack-political-climate-goals-083243079.html",
      "Discription": "Beijing on Wednesday accused developed countries including the US of doing too little to curb global warming, ahead of a UN summit discussing controversial issues including climate compensation.  China is the world's second-largest economy and the biggest emitter of carbon dioxide, but has repeatedly argued that developed nations should lead on tackling international climate obligations.  \"Developed countries' insufficient political will to provide support\" is the \"biggest problem\" currently facing international climate efforts, said Zhao Yingmin, vice-minister of ecology and environment, at a press conference Wednesday."
   },
   {
      "Title": "Melania Trump loudly booed and heckled by children at opioid summit in Baltimore",
      "Date": "Tue, 26 Nov 2019 12:46:00 -0500",
      "Link": "https://news.yahoo.com/melania-trump-loudly-booed-heckled-174600675.html",
      "Discription": "First lady Melania Trump has been met with sustained boos at an event in Baltimore for high school and middle school students, where she delivered remarks about the ongoing opioid crisis facing America.The intensity of the boos were an apparent first for Ms Trump, who has largely avoided direct backlash during her husband's polarising presidency, and reporters who cover her regularly were quick to note on Tuesday that they had never encountered that level of aggravation aimed at the first lady during a solo appearance."
   },
   {
      "Title": "Leaked Chinese documents give unprecedented insight into how Muslim detention centers in Xinjiang control detainees' every move",
      "Date": "Wed, 27 Nov 2019 03:06:40 -0500",
      "Link": "https://news.yahoo.com/leaked-chinese-documents-unprecedented-insight-080640484.html",
      "Discription": "Uighur activities, including indoctrination classes, mealtimes, family visits, medical treatments, and even bathroom breaks are \"strictly managed.\""
   },
   {
      "Title": "71 Gifts That Give Good Vibes",
      "Date": "Tue, 26 Nov 2019 12:57:21 -0500",
      "Link": "https://news.yahoo.com/71-gifts-good-vibes-175721472.html",
      "Discription": ""
   },
   {
      "Title": "Woman killed by feral hogs outside Texas home: ‘One of the worst things I had ever seen’",
      "Date": "Tue, 26 Nov 2019 10:12:18 -0500",
      "Link": "https://news.yahoo.com/woman-killed-feral-hogs-outside-121726181.html",
      "Discription": "Chambers County Sheriff Brian Hawthorne said Christine Rollins, 59, was found outside an elderly couple's home where she worked as a caretaker."
   },
   {
      "Title": "Pompeo Suggests Ukraine Hacking Conspiracy Is Legit Question",
      "Date": "Tue, 26 Nov 2019 12:02:12 -0500",
      "Link": "https://news.yahoo.com/pompeo-suggests-ukraine-hacking-conspiracy-170212808.html",
      "Discription": "SAUL LOEBSecretary of State Mike Pompeo suggested in a Tuesday press conference that a conspiracy theory that Ukraine and not Russia hacked the Democratic National Committee in 2016 is a legitimate line of inquiry. Asked if the U.S. and Ukraine should investigate whether “Ukraine and not Russia hacked the DNC,” Pompeo, who previously served as CIA director, replied: “Anytime there is information that indicates that any country has messed with American elections, we not only have a right but a duty to make sure we chase that down.” The CIA, shortly before Pompeo took office, concluded along with other U.S. intelligence agencies that Russia hacked the DNC server and stole internal emails during the 2016 election. “I can assure you that there were many countries that were actively engaged in trying to undermine American democracy, our rule of law, the fundamental understandings we have here in the United States, and you should know we were diligently, diligently working to make sure we addressed each of them with every tool of American power that we had,” Pompeo continued. “To protect our elections, America should leave no stone unturned, so whatever nation it is that we have information that so much as suggests that there might have been interference, or an effort to interfere in our elections, we have an obligation to make sure that the American people get to go to the ballot box, cast their ballots in a way that is un-impacted by these malevolent actors trying to undermine our western democratic values.”Last week, Fiona Hill, the former National Security Council director for Russia, testified before the impeachment inquiry that Ukranian election interference in 2016 was “a fictional narrative that has been perpetrated and propagated by the Russian security services themselves.” In President Trump’s fateful July 25 call with Ukranian President Volodomyr Zelensky, Trump asked Zelensky for the “favor” of the Ukranians investigating the theory ahead of a potential White House meeting. Pompeo was on that call. As well, after Trump suggested in a tweet that he would be open to Pompeo testifying before that inquiry, Pompeo said Tuesday in response: “When the time is right, all good things happen.”The Conspiracy Theory So Far Out There Even Trump’s Biggest Defenders Are Walking Away From ItRead more at The Daily Beast.Got a tip? Send it to The Daily Beast hereGet our top stories in your inbox every day. Sign up now!Daily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more."
   },
   {
      "Title": "Trump supporters say God chose him to be president",
      "Date": "Mon, 25 Nov 2019 17:16:06 -0500",
      "Link": "https://news.yahoo.com/trump-supporters-say-god-chose-him-to-be-president-221606696.html",
      "Discription": "Energy Secretary Rick Perry and former U.S. Ambassador to the U.N. Nikki Haley see God’s hand in picking Donald Trump as president."
   },
   {
      "Title": "Jury hears 911 call from night engaged doctors were killed in penthouse",
      "Date": "Tue, 26 Nov 2019 01:09:55 -0500",
      "Link": "https://news.yahoo.com/jury-hears-911-call-night-060955562.html",
      "Discription": "Jury in the murder trial of Bampumim Teixeira hears a 911 call from the night Dr. Richard Field and Dr. Lina Bolaños were killed in their penthouse"
   },
   {
      "Title": "A gun is fired on US school grounds twice a week, database reveals",
      "Date": "Tue, 26 Nov 2019 18:02:12 -0500",
      "Link": "https://news.yahoo.com/scale-gun-violence-us-schools-125828724.html",
      "Discription": "More than once a month in the past year, gunfire has turned deadly, gun control advocates findPolice officers take part in active shooter response training exercise at Fountain middle school in Fountain, Colorado, in June 2017. Photograph: Dougal Brownlie/APA gun is fired on a school campus in America nearly twice a week. Suicide, homicides, a police shooting, attacks on students by other students: more than once a month this past year, gunfire on American school and university campuses has turned deadly, according to a database of school gunfire incidents compiled by advocates.In the latest in a series of brutal shootings in California, and 11-year-old boy and a 16-year-old boy were shot to death in the parking lot of an elementary school in Union City, California, in the early hours of Saturday morning. Police had no immediate motive for the shooting, but said that a suspect or suspects had fired into the van the boys were sitting in multiple times.Schools are one of the safest places for kids in the United States, and shootings in and around schools represent only a tiny fraction of the violence that children face here on a daily basis. But even the small amount of gun violence that occurs at American schools adds up.Since the Columbine shooting in 1999, at least 233,000 kids across 243 schools have been exposed to gun violence during school hours, a Washington Post investigation found.Experts are quick to put that number in context. Researchers found that nearly 1,300 American children aged 17 and younger die from gunshot wounds each year, and they are more likely to be killed in homes or neighborhoods than at school.Domestic violence is particularly deadly. In San Diego, a domestic violence mass shooting claimed the lives of three young boys and their mother, all shot to death by the boys’ father on 16 November, according to police. The fourth brother, nine-year-old Ezekiel Valdivia, died on Saturday afternoon, the San Diego Union-Tribune reported.That single domestic violence shooting was deadlier than any of the school shooting attacks in the United States so far in 2019, according to tallies compiled by the Washington Post and the New York Times.“Gunfire on school grounds is just the tip of the iceberg when it comes to how gun violence affects children and teenagers,” said Ruhi Bengali, a senior associate at Everytown for Gun Safety, the country’s largest gun control advocacy organization.But tracking gun violence on school grounds, as Everytown has done since after the 2012 Sandy Hook elementary school shooting, does provide a window into the many ways gun violence burdens young people, even in places that are “inherently meant to be safe spaces for learning”, Bengali said.Everytown’s analysis found that 20% of all gunfire on school grounds comes from unintentional shootings, but that even these “actually resulted in a fair number of injuries. Gun suicides, with no intent to harm anyone else, represented 12% of all incidents,” she said.As with other kinds of gun violence in America, students of color, and black students in particular, were disproportionately affected.Black students make up only 15% of the school population for K-12 schools, yet represented 24% of student victims in instances of gunfire on school grounds, she said.For the students affected by ongoing gun violence in and around their schools, local officials can offer additional counselors, but little evidence of national change on gun laws: Republican lawmakers have blocked any substantive gun control laws for the past quarter-century.In Union City, where the two kids were killed in the elementary school parking lot, students are out of school this week for the Thanksgiving holiday, but will have “district and community mental health providers available” when they return to school, spokesman John Mattos said.Not far away, students at Carl Munck elementary school in Oakland have also had additional counselors available to them. The president of the school’s Parent Teacher Association, Misty Smith Walton, was shot to death outside her Oakland apartment earlier this month.Her death wasn’t a school shooting. But that didn’t mean it does not affect the school.“She was always looking to improve her sons’ classes and their school, always there to do whatever was needed in the front office, on the yard or anywhere else on campus,” the superintendent said in a statement, calling her death a “horrific crime”."
   },
   {
      "Title": "Hong Kong police plan to enter ransacked campus on Thursday",
      "Date": "Wed, 27 Nov 2019 06:58:04 -0500",
      "Link": "https://news.yahoo.com/hong-kong-police-plan-enter-ransacked-campus-thursday-115804703.html",
      "Discription": "Hong Kong police plan to send officers on Thursday morning into the ransacked remains of a university campus where authorities faced off for days with barricaded pro-democracy protesters, an official said Wednesday.  Hong Kong Polytechnic University (PolyU) was the epicentre of the territory's increasingly violent protest movement when clashes broke out on November 17 between police and protesters armed with bows and arrows as well as Molotov cocktails.  The stand-off then settled into a tense stalemate during which hundreds fled the campus -- some attempting to get out through sewer lines or shimmying down ropes onto waiting motorbikes -- leaving a dwindling core of holdouts surrounded by police cordons."
   },
   {
      "Title": "Woman kept husband’s body in freezer for up to 11 years",
      "Date": "Wed, 27 Nov 2019 07:49:24 -0500",
      "Link": "https://news.yahoo.com/woman-kept-husband-body-freezer-124300451.html",
      "Discription": "The body of a man was found in the freezer of a deceased woman’s home and may have been kept there for over a decade, police say.The remains of both individuals were found during a welfare check on a 75-year old woman who had not been seen in about two weeks by a building maintenance worker."
   },
   {
      "Title": "China's H-20 Stealth Bomber Could Be the U.S. Military's Worst Nightmare",
      "Date": "Mon, 25 Nov 2019 22:30:00 -0500",
      "Link": "https://news.yahoo.com/chinas-h-20-stealth-bomber-033000620.html",
      "Discription": "Be on notice."
   },
   {
      "Title": "Kremlin pays tribute to late Soviet spy it says may have changed history",
      "Date": "Wed, 27 Nov 2019 11:01:27 -0500",
      "Link": "https://news.yahoo.com/kremlin-pays-tribute-soviet-spy-160127646.html",
      "Discription": "The Kremlin on Wednesday paid tribute to a late Soviet intelligence officer it credits with helping foil a Nazi plot to kill Winston Churchill, Josef Stalin and Franklin Roosevelt, saying her career may have changed the course of history.  Goar Vartanyan, who died on Monday at the age of 93, was an undercover field operative for decades and allegedly helped thwart a plan backed by Adolf Hitler to assassinate the allied leaders at their first \"Big Three\" conference in Tehran in 1943.  Born in Armenia in 1926, Vartanyan moved to Iran in the 1930s where, at the age of 16, she joined an anti-fascist group led by her future husband, Soviet spy Gevork Vartanyan, that was tasked with ensuring security for the World War Two conference."
   },
   {
      "Title": "An 'unprecedented' bomb cyclone will bring 100-mph winds to the West Coast",
      "Date": "Wed, 27 Nov 2019 06:22:04 -0500",
      "Link": "https://news.yahoo.com/bombogenesis-unprecedented-bomb-cyclone-blast-202940745.html",
      "Discription": "A rare West Coast “bomb cyclone” is forecast to sweep into southern Oregon and northern California later Tuesday and into Wednesday."
   },
   {
      "Title": "3 accused war criminals wanted by Trump for campaign: Reports",
      "Date": "Tue, 26 Nov 2019 09:44:24 -0500",
      "Link": "https://news.yahoo.com/3-accused-war-criminals-wanted-144424800.html",
      "Discription": "President Trump has reportedly told aides he wants three convicted or accused war criminals to campaign for him during his bid for reelection in 2020."
   },
   {
      "Title": "20 of the World's Most Stunning Public Staircases",
      "Date": "Wed, 27 Nov 2019 08:00:00 -0500",
      "Link": "https://news.yahoo.com/12-world-apos-most-stunning-183035056.html",
      "Discription": ""
   },
   {
      "Title": "Trump claims he'd 'love' for top aides to testify, but won't allow it",
      "Date": "Tue, 26 Nov 2019 11:53:58 -0500",
      "Link": "https://news.yahoo.com/trump-love-to-bolton-pompeo-mulvaney-testify-future-presidents-165358664.html",
      "Discription": "“I would love to have Mike Pompeo, Rick Perry, Mick Mulvaney and many others testify,” the president tweeted after a federal judge ordered former White House counsel Don McGahn to appear before Congress. The Justice Department is appealing the ruling."
   },
   {
      "Title": "Florida Woman Reported an ‘Unknown’ Body in Her Driveway. Hours Later, She Was Charged With Murder.",
      "Date": "Mon, 25 Nov 2019 16:39:49 -0500",
      "Link": "https://news.yahoo.com/florida-woman-reported-unknown-body-213949388.html",
      "Discription": "Early Saturday morning, 51-year-old Yvonne Serrano called Florida authorities to report a grisly scene in the driveway of her Coral Springs home.“I just walked out and there is a car in my driveway with a dead body,” she told the 911 dispatcher. “There’s blood..she’s been here for a while,” she added. “She’s bleeding everywhere.”During the frantic, five-minute phone call, Serrano insisted she had no idea what a dead body was doing in her driveway. But hours later—after changing her story multiple times—Serrano was charged with second-degree murder and tampering with physical evidence for allegedly shooting 21-year-old Daniela Tabares outside her home, then trying to cover it up, Coral Springs police said.Authorities said the pair had gone to the movies and a bar on Friday night with friends from their local gym, a night of fun that ended with a bullet in Tabares’ forehead. California Man Who Rapped About Burying His Girlfriend Is Charged With Her Murder“Daniela is an inspiration. She is the [sic] shining example of what the best of us can only try to be,” the gym that organized the group event said in a Facebook statement on Monday. “It shines through in the joy, laughter,  and loving sassiness she shared with us. It shines through in the boundless love she gave us and the selfless care she took for the people around her. We cannot measure her loss.”According to a police affidavit obtained by The Daily Beast, deputies arrived at Serrano’s house early Saturday morning to find Tabares “partially inside the driver’s side of a Nissan Kicks”—her right foot still inside the SUV while the rest of her body was on the driveway. “The victim was lying on her back with a fatal gunshot wound on her forehead,” the affidavit states. The medical examiner later determined that Tabares died from a single gunshot to the head by a 9mm pistol.Serrano initially told police she’d “discovered” the body on her way to the gym, but when authorities arrived, she “was not dressed in gym attire and did not appear ready to go for a work out,” according to the affidavit. The 51-year-old admitted to police during questioning that she knew Tabares, saying they’d seen the movie 21 Bridges together at around 7:30 p.m. the night before. While they “did not sit together,” Serrano told police the two went as a “part of a very large group of friends” who all attended the “Training for Warriors” gym in Coral Springs.Sarah Stern’s Childhood Friend Found Guilty of Murdering Her for Her InheritanceThe group went to a bar, World of Beer, after the movie, the affidavit states. The gastropub’s surveillance video shows Tabares and Serrano “conversing, laughing and drinking for several hours” before leaving the bar together.Serrano told police she had “originally mentioned taking an Uber home from the bar,” but Tabares “volunteered to drive” her home. Surveillance video from her neighborhood shows Tabares pulling into Serrano’s driveway at around 2 a.m. Her headlights turned off about five minutes later, and the car remained in the same position until police arrived about three hours later, the affidavit states. When police questioned Serrano about her story’s discrepancies, she then stated she’d “blacked out” at a bar and “had no recollection of how she got home,” according to the report. All “she remembered after World of Beer was waking up in her own bed” early the next morning, she told police. A few hours later, Serrano changed her story again, stating she actually woke up in Tabares’ passenger seat at around 5:55 a.m. and saw the driver’s door open and the 21-year-old “lying in the driveway,” police said. At that point, she also admitted she had a concealed weapons permit and three guns—including a 9mm pistol that she usually carried around but had removed and placed under her bed after calling the police.“The defendant advised that she then changed out of a white tank top she was wearing and place it in the washing machine” because it had blood on it, the affidavit states.Family Sues Man They Say Left Their Daughter to Die on Florida HighwayPolice said her pistol and its holder tested positive for human blood, and linked shell casings found inside Tabares’ car to the weapon.  It was not immediately clear if Serrano, who is currently being held at the Broward County Jail without bond, has an attorney. Tabares’ family did not immediately respond to The Daily Beast’s requests for comment. Tabares’ friends paid tribute to the 21-year-old on social media, calling her a selfless person with a “good soul.”“My BFF always tried to help! Always nice to people! Always smiling!,” one of Tabares friends, Karo Miller, wrote on Facebook Monday. “Can’t even find the words!”“Daniela Maya Tabares, such a good soul! You will always be remembered,” another friend added on Facebook. Read more at The Daily Beast.Got a tip? Send it to The Daily Beast hereGet our top stories in your inbox every day. Sign up now!Daily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more."
   },
   {
      "Title": "Saudi crown prince visits UAE amid push to end Yemen war",
      "Date": "Wed, 27 Nov 2019 11:24:06 -0500",
      "Link": "https://news.yahoo.com/saudi-crown-prince-visits-uae-amid-push-end-162406093.html",
      "Discription": "Saudi Crown Prince Mohammed bin Salman visited the United Arab Emirates Wednesday, as efforts to end the nearly five-year war in Yemen gain momentum.  Riyadh and Abu Dhabi are close allies and key members of a military coalition backing the government in Yemen against the Iran-aligned Huthi rebels."
   },
   {
      "Title": "Police cited 55 people for eating on San Francisco trains. Only nine were white",
      "Date": "Tue, 26 Nov 2019 17:15:57 -0500",
      "Link": "https://news.yahoo.com/police-cited-55-people-eating-221557904.html",
      "Discription": "New data renews concerns about racial profiling, just weeks after viral video showed police detaining a black man who was eating a sandwichPassengers wait for a Bart train to depart the Fruitvale station in Oakland, California. Photograph: Ben Margot/APPolice officers for the San Francisco Bay Area commuter train system disproportionately target black riders with citations for eating and drinking, according to new data, renewing concerns about racial profiling.The Bay Area Rapid Transit (Bart) data was released following a viral video showing police handcuffing a 31-year-old black man who was cited for eating a breakfast sandwich on his way to work. The new records show that more than 81% of people stopped for eating and drinking on Bart since 2014 were people of color, and that the vast majority of them were black.Stops for eating and drinking on trains or platforms are infrequent within Bart, the train system that runs between San Francisco, Oakland and surrounding suburbs. Of 55 people cited for this offense over the last five years, 33 were black passengers, representing 60% of the citations. Nine of the stops were white passengers, seven were listed as Hispanic, five were categorized as “other” and one was unknown, according to the data, which was obtained by the San Francisco Examiner.Only 10% of Bart’s total riders are black, meaning they are six times more likely than others to be stopped for eating and drinking. Ridership data, collected last year, showed that 35% of overall riders are white, 32% are Asian/Pacific Islander and 17% are Latino.Bart spokeswoman Alicia Trost said in an email that the data shows citations are “very rare” and are “handed out at stations across the system”.She said: “When an officer witnesses someone eating, they remind the rider that eating is not allowed and if the rider puts the food away no citation is necessary. It is a rare occurrence to need to issue a citation after reminding the rider not to eat.”John Burris, a civil rights lawyer representing Steve Foster, the man stopped in the recent video, said Tuesday that the data was not surprising and was evidence of racial profiling. “This is a form of biased policing, and it’s very harmful to African Americans. Other people eat sandwiches all the time, and they don’t get stopped.”The 15-minute video that received national attention showed a white Bart police officer stopping Foster at the station in Pleasant Hill, north-east of Oakland. The footage showed the officer holding on to Foster’s backpack and telling him he was not free to go until he identified himself and that he was resisting arrest. Backup officers arrived, and Foster was handcuffed and taken away in front of morning commuters.The citation he received required him to pay a $250 fine or do 48 hours of community service.“It was so insulting to him and disturbing,” said Burris. “He was humiliated in front of all the people on Bart.”The video sparked protests and widespread criticism, and Bart leaders eventually apologized and promised to investigate. Bob Powers, Bart’s general manager, said at the time he was “disappointed how the situation unfolded”.A citation or arrest for a minor infraction like eating can escalate to a significantly more serious conflict, said Cat Brooks, the co-founder of the Anti Police-Terror Project in Oakland.“Eating a sandwich is certainly not a reason to throw yet another black body into the criminal justice system,” she said. “We have to hold these cops accountable for racial profiling.”Bart police have long faced scrutiny for brutality and racial profiling, in particular following the 2009 killing of Oscar Grant, an unarmed 22-year-old shot dead on the Fruitvale station platform. There have since been a number of other killings and allegations of abuse by Bart police.Bart should not be citing anyone for eating in the first place, Brooks said.Burris said there should be better training to prevent biased policing, and that it was wrong to handcuff riders for eating.Trost, the Bart spokeswoman, said all officers receive training in “fair and impartial policing, bias-based policing … and de-escalation”.The Bart controversy comes as the Metropolitan Transportation Authority (MTA) in New York is facing intense backlash over a number of viral videos of police, including the arrest of a food vendor selling churros, and an incident in which officers pulled guns on a teenager accused of fare evasion."
   },
   {
      "Title": "Stealth 'Killer': Why Russia's Su-35 Might End Up Being Too Good",
      "Date": "Mon, 25 Nov 2019 19:15:00 -0500",
      "Link": "https://news.yahoo.com/stealth-killer-why-russias-su-001500665.html",
      "Discription": "As in damaging the chances of Russia going all-in on the Su-57?"
   },
   {
      "Title": "‘Anti-Islam’ Europe Is No Place for Azerbaijan, President Says",
      "Date": "Wed, 27 Nov 2019 06:32:03 -0500",
      "Link": "https://news.yahoo.com/anti-islam-europe-no-place-113203389.html",
      "Discription": "(Bloomberg) -- President Ilham Aliyev said Azerbaijan won’t seek closer integration with Europe, which he accused of discriminating against Muslims and undermining his country’s traditional values.“Where shall we integrate?” Aliyev said in a rare public criticism of the West in a speech to university students and teachers in the capital, Baku, on Tuesday. “Shall we integrate with those who are saying ‘Stop Islam’? Shall we integrate to a place where there’s no difference being made between men and women? We definitely shall not.”Aliyev’s remarks mark a departure from the national security strategy he approved in 2007, which said energy-rich Azerbaijan targets membership in European and Euro-Atlantic alliances. The majority Muslim but secular nation of 10 million people sandwiched between Iran and Russia forged close political and economic ties with the U.S. and the European Union after declaring independence from the former Soviet Union in 1991.The president’s speech “was his acknowledgment of the failure of secularism and western values in Azerbaijan,” prominent Azeri journalist Khadija Ismayil wrote on Facebook. Ismayil, who’s known for investigative reports into Aliyev’s undeclared family businesses, was sentenced to prison in 2015 and freed the following year after international criticism of her detention and trial.Energy PartnerThe U.S. helped Azerbaijan build oil and gas pipelines westward bypassing Russia. The EU regards Azerbaijan as a strategic energy partner and began talks in 2017 on a new framework agreement with Baku.While Aliyev and his late father Heydar, who ruled Azerbaijan for 10 years before his death in 2003, refused to join Russian-led military and economic blocs, U.S. and EU criticism of the poor state of democracy and human rights in Azerbaijan have strained relations. Aliyev won a landslide to secure a fourth term and extend his rule for seven years in 2018 elections seen as flawed by Western observers and boycotted by opposition parties.The president is “quite sincere” in his opposition to European integration because “Europe means democracy, free elections, rule of law, universal human rights and social welfare,” Altay Goyushov, an opposition politician who heads the Baku Research Institute, a think tank in the city, wrote on Facebook.“Aliyev wants to see a medieval monarchy in Azerbaijan,” he said.To contact the reporter on this story: Zulfugar Agayev in Baku at zagayev@bloomberg.netTo contact the editors responsible for this story: Torrey Clark at tclark8@bloomberg.net, Tony HalpinFor more articles like this, please visit us at bloomberg.com©2019 Bloomberg L.P."
   },
   {
      "Title": "Banning large-capacity gun magazines could reduce mass shooting deaths: study",
      "Date": "Tue, 26 Nov 2019 17:30:27 -0500",
      "Link": "https://news.yahoo.com/banning-large-capacity-gun-magazines-223027357.html",
      "Discription": "Attacks with large-capacity magazines had more than a 60% higher average death toll, researchers write in the American Journal of Public Health.  \"One of the strategies for surviving an active shooting is to 'run, hide, fight.' For those in the line of fire, the opportunity to flee, take cover, or counterattack is expanded if an interruption in the shooting occurs,\" said Louis Klarevas of Columbia University's Teachers College in New York City, who led the study.  In 1994, Congress enacted a federal assault weapons ban, which limited these types of magazines, but the ban expired a decade later."
   },
   {
      "Title": "Gabbard Continues to Slam Clinton for Russian ‘Grooming’ Remarks",
      "Date": "Wed, 27 Nov 2019 08:25:53 -0500",
      "Link": "https://news.yahoo.com/gabbard-continues-slam-clinton-russian-132553226.html",
      "Discription": "Representative Tulsi Gabbard (D., Hawaii) continued to lash out at Hillary Clinton on Tuesday following the former presidential candidate's insinuation that Gabbard's presidential policy platform was based on advancing Russian interests.\"I think they’ve got their eye on someone who’s currently in the Democratic primary and are grooming her to be the third-party candidate,” Clinton said on the Campaign HQ podcast in October. According to Clinton, Gabbard was \"the favorite of the Russians. They have a bunch of sites and bots and other ways of supporting her so far.\"When asked about the comments, Clinton spokesman Nick Merrill seemed to confirm that she had been referring to the Russians, when he said, \"If the nesting doll fits.\" But Clinton later backtracked and insisted she was referring to Republicans, not the Russians, as \"grooming\" Gabbard.Speaking on Tuesday with stand-up comedian Joe Rogan on \"The Joe Rogan Experience,\" Gabbard and the host both criticized Clinton for her comments.“When you look at the media establishment pushing a lot of the same narrative and a lot of the same message, then you can see how someone gets away with calling a sitting member of Congress, a candidate for president, a soldier actively serving in the National Guard, veteran of two Middle East deployments, basically a traitor of the country that I love and that I’m willing to lay my life down for,” Gabbard told Rogan. “And to get away with it without any evidence or basis whatsoever.”When Rogan asked how Clinton was able to make her accusation without any evidence to support it, Gabbard blamed the \"power of the Clinton machine\" and \"the power of the political establishment\" for allowing Clinton's accusation to go unchecked.Gabbard is currently polling at below 2 percent of the national Democratic primary vote, according to RealClearPolitics. The congresswoman raised considerable controversy by meeting with Syrian dictator Bashar al Assad in 2017."
   },
   {
      "Title": "US weather forecast: Powerful storms to bring heavy snow and high winds, causing Thanksgiving travel chaos",
      "Date": "Tue, 26 Nov 2019 13:36:00 -0500",
      "Link": "https://news.yahoo.com/powerful-storms-bring-heavy-snow-183600873.html",
      "Discription": "Millions of Americans are bracing for two \"powerful\" storms expected to dump heavy blankets of snow and force road closures and flight delays as families prepare for a busy week of travel during the Thanksgiving holiday.A snowy weather system could linger through the rest of the week and into the weekend as it moves east, potentially bringing snow to New England and delivering a wintry coast-to-coast blow to the holiday weekend."
   },
   {
      "Title": "How Devin Nunes lawsuit threat undermines Donald Trump's impeachment defense",
      "Date": "Tue, 26 Nov 2019 09:31:56 -0500",
      "Link": "https://news.yahoo.com/devin-nunes-lawsuit-threat-undermines-143156464.html",
      "Discription": "He's not going to win, and in the long run, he may end up hurting the very man he's trying to protect."
   },
   {
      "Title": "Epstein Suicide: Guards Say They're Scapegoats for a Broken System",
      "Date": "Tue, 26 Nov 2019 09:18:27 -0500",
      "Link": "https://news.yahoo.com/epstein-suicide-guards-theyre-scapegoats-132249169.html",
      "Discription": "NEW YORK -- Two jail guards who were on duty when Jeffrey Epstein killed himself browsed the internet and napped during the night before his body was found, instead of checking on him every half-hour as they were required to do, prosecutors have said. The guards then lied, prosecutors said, on official logs, indicating that they had made the rounds when they had not.Attorney General William Barr said last week that Epstein's death resulted from \"a perfect storm of screw-ups.\"But lawyers for the guards, who have been criminally charged, suggested in court Monday that their clients were being made into scapegoats for larger problems in the federal prison system that contributed to Epstein's death.The Manhattan jail where Epstein hanged himself has long been plagued by staff shortages and the two guards, Michael Thomas and Tova Noel, had already done several tours of overtime that week.In addition, Epstein was left alone without a cellmate that night and morning, even though he had tried to take his own life about three weeks earlier.\"Unfortunately, the decisions that led to the death of Mr. Epstein were not only because of what my client did or did not do,\" Montell Figgins, the lawyer for Thomas, said. \"It was because of a system that failed completely.\"\"Where are the supervisors?\" Figgins added. \"Where are the people who make the policy decisions? Why didn't Mr. Epstein have a cellmate at the time that this happened?\"Figgins made his remarks outside U.S. District Court in Manhattan after a hearing at which Judge Analisa Torres set a trial date of April 20 for Thomas and Noel, who face charges that include making false records and conspiracy to defraud the United States. Both have pleaded not guilty.Noel's lawyer, Jason E. Foy, said that he had not seen the evidence against his client, but he vowed to investigate her case vigorously. He said he believed there were \"outside circumstances that are driving this prosecution.\"Foy, who also spoke after the hearing, said the charges did not \"sound like your regular false-document case,\" an apparent reference to the unusual circumstances and high-profile nature of Epstein's death.The U.S. attorney's office in Manhattan and the Bureau of Prisons declined to comment on the lawyers' assertions.The indictment charging the two guards highlighted lapses in the operation of a high-security unit at the Metropolitan Correctional Center in New York, where Epstein, a financier, was awaiting trial on sex trafficking charges when he died.The indictment also offered the first official narrative of the events preceding his death. It said that security cameras did not show anyone entering the cell block where Epstein was housed, suggesting that despite the conjecture and conspiracy theories swirling around Epstein and his connections to powerful people, his death was a suicide as New York City's chief medical examiner ruled.At the hearing Monday, a prosecutor, Rebekah A. Donaleski, told Torres that the discovery materials the government would provide to defense lawyers included hundreds of hours of video recordings from inside the jail.Although Donaleski did not elaborate on the recordings' contents, the indictment said that video obtained from the jail's internal video surveillance system confirmed that no one visited the tier where Epstein was being held after about 10:30 p.m. on Aug. 9.\"This was the last time anyone, including any correctional officer, walked up to, let alone entered, the only entrance to the tier in which Epstein was housed until approximately 6:30 a.m. on Aug. 10,\" when his body was found, the indictment said.The defense lawyers said in court that they wanted prosecutors to provide them with additional evidence that might be used at trial. Figgins cited an internal investigation by the Justice Department inspector general's office into the circumstances surrounding Epstein's death. The results of that inquiry will not be made public, officials have said.Outside the courthouse, Figgins said that there had been an unfair \"rush to judgment\" in the case and that the two guards were being made to pay for the problems of an entire system.\"Does anyone think that throughout the United States that these are the only two guards that may have taken a nap overnight on their shift?\" he said. \"I highly doubt it.\"The attention that Epstein's suicide has brought to prison conditions, inmate supervision and mental health issues around the country was reinforced Sunday with a letter published in The New York Times by Richard M. Berman, the federal judge in Manhattan who presided in Epstein's criminal case before his suicide.Berman wrote that the indictment of the two guards was not the \"full accounting\" to which Epstein's alleged victims, the public and his family were entitled.\"We all agree that it is unthinkable that any detainee, let alone a high-profile detainee like Mr. Epstein, would die unnoticed at the Metropolitan Correctional Center,\" the judge wrote.He said it would be \"a tragic and costly missed opportunity\" for the Bureau of Prisons and the attorney general \"to fail to undertake -- and to make public -- an in-depth evaluation of prison conditions (not only at the MCC) and to carry out appropriate reforms.\"This article originally appeared in The New York Times.(C) 2019 The New York Times Company"
   },
   {
      "Title": "Freed UK hostage and wife say chained, threatened in Philippines",
      "Date": "Tue, 26 Nov 2019 05:11:31 -0500",
      "Link": "https://news.yahoo.com/freed-uk-hostage-wife-chained-threatened-philippines-101131304.html",
      "Discription": "A British man and his wife rescued this week from Islamist captors in the Philippines' south say they were chained and threatened with beheading if they didn't deliver a ransom.  The couple, shaken but unharmed, told their nearly two-month ordeal to reporters after escaping during a firefight Monday between Philippine troops and the Islamic State-linked Abu Sayyaf group.  The husband, named by British authorities as Alan Hyrons, painted a \"very humiliating and degrading\" life in captivity, with little to eat in a haze of constant fear."
   },
   {
      "Title": "Texas chemical plant explosion injures 3 and causes 'extensive damage' to Port Neches",
      "Date": "Wed, 27 Nov 2019 14:09:13 -0500",
      "Link": "https://news.yahoo.com/3-injured-texas-plant-blast-120259456.html",
      "Discription": "An early morning explosion rocked an East Texas chemical plant in Port Neches, injuring three workers."
   },
   {
      "Title": "7 Amazing Facts About the Speedy Cheetah",
      "Date": "Wed, 27 Nov 2019 12:45:00 -0500",
      "Link": "https://news.yahoo.com/7-amazing-facts-speedy-cheetah-174500272.html",
      "Discription": ""
   },
   {
      "Title": "What China Wants in the South China Sea",
      "Date": "Tue, 26 Nov 2019 09:32:00 -0500",
      "Link": "https://news.yahoo.com/china-wants-south-china-sea-143200850.html",
      "Discription": "Inside Beijing's strategy."
   },
   {
      "Title": "U.S. House panel sues Barr, Ross seeking to enforce Census probe subpoenas",
      "Date": "Tue, 26 Nov 2019 11:18:10 -0500",
      "Link": "https://news.yahoo.com/u-house-panel-sues-barr-161810864.html",
      "Discription": "U.S. House of Representatives Democrats filed a federal lawsuit on Tuesday seeking to enforce subpoenas against Attorney General William Barr and Commerce Secretary Wilbur Ross as part of their investigation into the Trump administration's handling of the U.S. 2020 Census.  The House Oversight and Reform Committee in July held Barr and Ross in criminal contempt for defying the panel's subpoenas as lawmakers probe the administration's attempt to add a controversial citizenship question to the government's population count."
   },
   {
      "Title": "Assad: IS members in Syrian Kurds jails to stand local trial",
      "Date": "Wed, 27 Nov 2019 07:54:23 -0500",
      "Link": "https://news.yahoo.com/assad-members-syrian-kurds-jails-125423341.html",
      "Discription": "Syrian President Bashar Assad said in remarks published Wednesday that members of the Islamic State group held in the country will stand trial in local courts specialized in terrorism cases.  Assad made his comments in an interview with Paris Match when asked about a deal with a Kurdish-led force that would eventually bring their areas under government control.  The Kurdish-led Syrian Democratic Forces, who defeated IS in March with the help of the U.S.-led coalition, are holding more than 10,000 militants, mostly Syrians and Iraqis, including some 2,000 foreigners."
   },
   {
      "Title": "Boeing's problems mount as FAA vows to ramp up oversight of the embattled 737 Max even after it is finally allowed to fly",
      "Date": "Tue, 26 Nov 2019 21:38:56 -0500",
      "Link": "https://news.yahoo.com/boeings-problems-mount-faa-vows-023856929.html",
      "Discription": "A new report also suggested that Boeing's plane to resume deliveries of new 737 Max planes to airline customers in December won't happen."
   },
   {
      "Title": "Why Testimony From Don McGahn Would Doom Trump",
      "Date": "Tue, 26 Nov 2019 05:00:44 -0500",
      "Link": "https://news.yahoo.com/why-testimony-don-mcgahn-doom-100044090.html",
      "Discription": "Win McNamee/GettyJust as the House Intelligence Committee ran out of scheduled hearings, and it seemed clear that not a single Republican would vote for impeachment, another shoe has dropped: Monday’s ruling to compel congressional testimony from former White House Counsel Don McGahn looks to be a game-changer, leading McGahn to spill the beans on Donald Trump, and possibly compelling other Executive Branch members to testify before the House.  The White House will appeal of course, but if the ruling is upheld, it’s huge. Why does McGahn matter? According to the Mueller Report (and based on interviews with McGahn and others), Trump directed McGahn to call Deputy Attorney General Rod Rosenstein to “have the special counsel removed.” Judge Orders Former Trump White House Lawyer Don McGahn to Obey Congressional SubpoenaMcGahn refused to comply—one of the many examples in which subordinates potentially saved the president from an obstruction of justice charge. Few people actually read the Mueller Report, of course, and if McGahn says in public, on national TV, what he apparently said to Mueller’s investigators, Trump’s public support could drop substantially, and it could lock in an obstruction count in whatever articles the House draws up.But that’s not even the biggest potential problem McGahn’s testimony could pose for Trump.Testimony from Roger Stone’s trial raised new questions regarding whether Trump lied in his written deposition to Mueller concerning whether he ever discussed WikiLeaks with Stone. Being caught lying to Mueller would, of course, be a very big deal. Don’t forget, Bill Clinton wasn’t brought down because of sex, but because of perjury. Michael Flynn was convicted of lying to the FBI. One of the charges Stone was convicted of was lying to Congress. If McGahn has to go up to the Hill and—under oath—answer whether the president lied or instructed him to lie in that written testimony, it would be a bombshell moment. And if McGahn were to testify that Trump did, in fact, lie to Mueller, that could be (I’m going to sound insane here, I know) enough to cause some Republican attrition.  As this all suggests Monday’s court decision might—MIGHT—end up being one of the most underrated developments of this saga. But it’s not just about McGahn. An equally consequential outcome of this court ruling could be that it makes it more likely that other top Executive Branch members—possibly including former National Security Adviser John Bolton—will testify.This might still be a long shot, but it’s not entirely crazy. In early November, Bolton’s lawyer sent a letter to the House saying his client “was personally involved in many of the events, meetings, and conversations about which you have already received testimony, as well as many relevant meetings and conversations that have not yet been discussed in the testimonies thus far.”Why would Bolton’s lawyer tease us like that? There seem to be two possible answers: Either Bolton is craving media attention, or he is looking for an excuse that would permit him to overcome the executive-privilege objections. If it’s the latter, the McGahn decision—which will surely be appealed—could at least provide a cover rationale.Another rationale for Bolton to comply with his subpoena: During her testimony, Fiona Hill might have provided such an excuse when she alleged that EU Ambassador Gordon Sondland “was being involved in a domestic political errand” while she was “involved in a national-security foreign policy. And those two things had just diverged.” This could potentially open the door for senior aides like Bolton (and Rudy Giuliani, Mike Pompeo, and Mick Mulvaney) to remain exempt from discussing national-security issues, while also being compelled to discuss this “domestic political errand,” which “diverged.”Regardless of how this plays out, Monday’s court ruling reinforces a point I’ve been making to the naysayers who believe impeachment is a fool’s errand. Once you start subpoenaing witnesses and accruing on-the-record testimony, it’s impossible to predict how one development might lead to another (just as testimony in the Stone trial might now play a major role in the impeachment inquiry). Additionally, sometimes, once you start the process, you get lucky. In this instance, however, Republicans seem to have drawn the short straw with Judge Ketanji Brown Jackson, an Obama appointee, whose questions during oral arguments last month seemed to signal she would rule in favor of the House.We are now looking at the possibility of a pincer move on Trump, involving McGahn and Bolton: The former gets him on lying, the latter on trying to rig the next election. If that happens, Trump’s political future is over. It might be time to start heading to the bunker.   Read more at The Daily Beast.Get our top stories in your inbox every day. Sign up now!Daily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more."
   },
   {
      "Title": "Police chief blasted over handling of aide's alleged racism",
      "Date": "Tue, 26 Nov 2019 23:06:34 -0500",
      "Link": "https://news.yahoo.com/police-chief-blasted-over-handling-040634553.html",
      "Discription": "Assistant Chief Justin Newsom retired last month amid allegations he used the n-word to refer to African Americans"
   },
   {
      "Title": "Frenchman, actor kidnapped in Mexico freed: officials",
      "Date": "Mon, 25 Nov 2019 18:38:22 -0500",
      "Link": "https://news.yahoo.com/kidnappers-demand-ransom-frenchman-mexico-204627972.html",
      "Discription": "A French citizen and a Mexican actor kidnapped in a national park in central Mexico were freed Monday, officials said.  The two men, identified as Frederic Michel and Alejandro Sandi, were traveling in all-terrain vehicles in the park around the Nevado de Toluca volcano when they were ambushed and abducted on Sunday, witnesses said.  A source with Mexico's anti-kidnapping unit told AFP both victims were unharmed."
   },
   {
      "Title": "New Chinese stealth fighter coming as soon as 2025",
      "Date": "Tue, 26 Nov 2019 10:10:15 -0500",
      "Link": "https://news.yahoo.com/chinese-stealth-fighter-coming-soon-151015632.html",
      "Discription": "The new Chinese stealth fighter could be flying through Asian skies as soon as 2025. In October 2018, Chinese media announced that the People’s Liberation Army Air Force would publicly unveil its new H-20 stealth bomber during a parade celebrating the air arm’s 70th anniversary in 2019."
   }
]